Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПрописиНаРусском</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПрописиНаУкраинском</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Валюты/Forms/ФормаПодбора/Ext/Form/Module.bsl
&НаКлиенте
Процедура Выбрать()
	
	СписокВалютВыбор(Элементы.СписокВалют, Неопределено, Неопределено, Истина);
	
КонецПроцедуры // Выбрать()

&НаКлиенте
Процедура СписокВалютВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если (ТекущиеДанные = Неопределено) Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыВыбор = Новый Структура("КодВалюты, НаименованиеКраткое, НаименованиеПолное, Загружается, ПараметрыПрописиНаРусском");
	ПараметрыВыбор.КодВалюты                 = ТекущиеДанные.КодВалютыЦифровой;
	ПараметрыВыбор.НаименованиеКраткое       = ТекущиеДанные.КодВалютыБуквенный;
	ПараметрыВыбор.НаименованиеПолное        = ТекущиеДанные.Наименование;
	ПараметрыВыбор.Загружается               = ТекущиеДанные.Загружается;
	ПараметрыВыбор.ПараметрыПрописиНаРусском = ТекущиеДанные.ПараметрыПрописиНаРусском;
	
	ОткрытьФорму("Справочник.Валюты.ФормаОбъекта", ПараметрыВыбор, ВладелецФормы);
	
	Закрыть();
	
КонецПроцедуры // СписокВалютВыбор()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КлассификаторXML = Справочники.Валюты.ПолучитьМакет("КлассификаторВалют").ПолучитьТекст();
	КлассификаторТаблица = __ОбщегоНазначенияСервер.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	Для Каждого СтрокаТаблицы Из КлассификаторТаблица Цикл
		НоваяСтрока = Валюты.Добавить();
		НоваяСтрока.КодВалютыЦифровой         = СтрокаТаблицы.Code;
		НоваяСтрока.КодВалютыБуквенный        = СтрокаТаблицы.CodeSymbol;
		НоваяСтрока.Наименование              = СтрокаТаблицы.Name;
		НоваяСтрока.СтраныИТерритории         = СтрокаТаблицы.Description;
		НоваяСтрока.Загружается               = СтрокаТаблицы.RBCLoading;
		НоваяСтрока.ПараметрыПрописиНаРусском = СтрокаТаблицы.NumerationItemOptions;
	КонецЦикла;
	
КонецПроцедуры // ПриСозданииНаСервере()
